#+BEGIN_COMMENT
.. title: Testing P5 with Mocha and Chai
.. slug: bdd-testing-p5
.. date: 2023-06-09 14:03:10 UTC-07:00
.. tags: p5.js,javascript,testing
.. category: Testing
.. link:
.. description: Going through the p5js.org test-driven development tutorial.
.. type: text
.. status:
.. updated:
.. template: p5.tmpl
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2

{{% javascripttag source="color-increaser.js" %}}
{{% p5div source="sketch.js" divid="6a5fb18a-bdd-sketch" %}}

** Running The tests
Now, let's see what it looks like when we run the tests.

#+begin_src fish :results output :exports both
mocha ../tests/test*
#+end_src

#+RESULTS:
#+begin_example


  Given the ColorIncreaser class definition
    When the ColorIncreaser is constructed
      ✔ Then it should be an object
      ✔ And it should set the color_increment
      ✔ And set the color attribute
    And when the increase() method is called
      ✔ Then it should increment red up until 255
      ✔ But red should wrap-around to 0 when it hits 256 and increment green
      ✔ And it should wrap-around green and increase blue if green exceeds 255
      ✔ And it should wrap-around all colors when blue exceeds 255
    And when the next() method is called
      ✔ Then it should increase the color
      ✔ And return the color


  9 passing (11ms)

#+end_example

The output in the terminal has some color added to the text so it looks prettier, but otherwise that's the output of running our tests.

